
       IDENTIFICATION DIVISION.
       PROGRAM-ID. HOLAMUND.

       ENVIRONMENT DIVISION.

       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 WS-MENSAJE PIC X(30) VALUE 'Hola desde COBOL'.

       PROCEDURE DIVISION.
       MAIN-LOGICA.

           DISPLAY WS-MENSAJE
           MOVE 0 TO RETURN-CODE
           STOP RUN.
